cask_args appdir: '/Applications'

# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'

# Install ZSH
#brew 'zsh'
#brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

# Install Binaries
#brew 'awscli'
brew 'git'
brew 'hub'
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'node'
brew 'trash'
brew 'wget'

# Development
#brew 'php71', args: ['with-debug']
#brew 'mariadb'

# Apps
#cask 'aerial'
cask 'alfred'
cask 'atom'
#cask 'caffeine'
#cask 'cheatsheet'
#cask 'dash'
cask 'dropbox'
#cask 'evernote'
#cask 'firefox'
#cask 'fluid'
cask 'google-chrome'
cask 'google-drive'
cask 'iterm2'
#cask 'mysqlworkbench'
#cask 'quip'
#cask 'rescuetime'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'vlc'

# Fonts
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
# mas
